app/Controllers/Library.php

SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows` FROM `anggota`
---
    public function index()
    {
        $bukuModel = new bukuModel();
        $anggotaModel = new anggotaModel();
        $pinjamkembaliModel = new pinjamkembaliModel();
        $data = [
            'title' => 'Dashboard Admin',
            'hari' => $this->getHariIndonesia(date('N')),
            'tanggal' => $this->getTanggalIndonesia(date('Y-m-d')),
            'jumlah_buku' => $bukuModel->countAll(),
            'jumlah_anggota' => $anggotaModel->countAll(),