app/Controllers/Pinjamkembali.php

    public function getBukuByJudul($judul)
    {
        $buku = $this->bukuModel->where('judul', $judul)->first();
---
SELECT *
FROM `buku`
WHERE `judul` = 'Seni Budaya'
 LIMIT 1

    public function getAnggotaByNama($nama)
    {
        $anggota = $this->anggotaModel->where('nama', $nama)->first();
---
SELECT *
FROM `anggota`
WHERE `nama` = 'Brian Utman'
 LIMIT 1

    public function peminjaman()
    {
        $isbn = $this->request->getVar('isbn');
        $buku = $this->bukuModel->where('isbn', $isbn)->first();
        $nomor = $this->request->getVar('nomor');
        $judul = $this->request->getVar('judul');
        $nama = $this->request->getVar('nama');
        $kelas = $this->request->getVar('kelas');
        $tgl_pinjam = $this->request->getPost('tgl_pinjam');
        $tgl_kembali = $this->request->getPost('tgl_kembali');
        if (!$buku) {
            return $this->response->setStatusCode(404)->setBody('Buku tidak ditemukan');
        }

        // Jika jumlah buku yang tersedia <= 0, tampilkan pesan error
        if ($buku['jumlah'] <= 0) {
            return $this->response->setStatusCode(400)->setBody('Buku sudah habis');
        }

        // Mengurangi jumlah buku yang tersedia
        $buku['jumlah']--;
        $this->bukuModel->save($buku);

        $this->pinjamkembaliModel->save([
            'isbn' => $isbn,
            'judul' => $judul,
            'nomor' => $nomor,
            'nama' => $nama,
            'kelas' => $kelas,
            'tgl_pinjam' => $tgl_pinjam,
            'tgl_kembali' => $tgl_kembali
        ]);
---
SELECT *
FROM `buku`
WHERE `isbn` = 'ISBN 978-602-8519-93-15'
 LIMIT 1
UPDATE `buku` SET `isbn` = 'ISBN 978-602-8519-93-15', `gambar` = 'novel 1.jpg', `judul` = 'Kala Senja Menyapa', `slug` = 'kala-senja-menyapa', `penulis` = 'Rosa Maria Aguado', `penerbit` = 'Gramedia', `jenis` = 'Novel', `tahun` = '2023', `halaman` = '50', `jumlah` = 14, `lokasi` = 'Rak Nomor 6'
WHERE `buku`.`id` IN ('60')
INSERT INTO `pinjamkembali` (`isbn`, `judul`, `nomor`, `nama`, `kelas`, `tgl_pinjam`, `tgl_kembali`) VALUES ('ISBN 978-602-8519-93-15', 'Kala Senja Menyapa', '16', 'Nia Yoviandini', '9E', '2023-08-14', '2023-08-21')

    public function pengembalian($id)
    {
        // Ambil data peminjaman berdasarkan id
        $pinjaman = $this->pinjamkembaliModel->find($id);
        $this->logpinjamkembaliModel->saveLog([
            'isbn' => $pinjaman['isbn'],
            'judul' => $pinjaman['judul'],
            'nomor' => $pinjaman['nomor'],
            'nama' => $pinjaman['nama'],
            'kelas' => $pinjaman['kelas'],
            'tgl_pinjam' => $pinjaman['tgl_pinjam'],
            'tgl_kembali' => $pinjaman['tgl_kembali'],
            'tgl_dibuat' => date('Y-m-d'),
            'status' => 'Pengembalian',
        ]);
        if (!$pinjaman) {
            return $this->response->setStatusCode(404)->setBody('Peminjaman tidak ditemukan');
        }

        // Ambil data buku berdasarkan ISBN
        $isbn = $pinjaman['isbn'];
        $buku = $this->bukuModel->where('isbn', $isbn)->first();
        if (!$buku) {
            return $this->response->setStatusCode(404)->setBody('Buku tidak ditemukan');
        }

        // Tambah jumlah buku yang tersedia
        $buku['jumlah']++;
        $this->bukuModel->save($buku);
        // hapus buku
        $this->pinjamkembaliModel->delete($id);
---
SELECT *
FROM `pinjamkembali`
WHERE `pinjamkembali`.`id` = '98'
SELECT *
FROM `buku`
WHERE `isbn` = 'ISBN 978-602-8519-93-4'
 LIMIT 1
UPDATE `buku` SET `isbn` = 'ISBN 978-602-8519-93-4', `gambar` = 'seni budaya.jpg', `judul` = 'Seni Budaya', `slug` = 'seni-budaya', `penulis` = 'Nasruddin Anshoriy', `penerbit` = 'Gramedia', `jenis` = 'Mata Pelajaran', `tahun` = '2022', `halaman` = '70', `jumlah` = 15, `lokasi` = 'Rak Nomor 1'
WHERE `buku`.`id` IN ('41')
DELETE FROM `pinjamkembali`
WHERE `id` IN ('98')