app/Models/logpinjamkembaliModel.php

    public function getLogPinjamKembali($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `logpinjamkembali`

    public function saveLog($data)
    {
        return $this->insert($data);
---
INSERT INTO `logpinjamkembali` (`isbn`, `judul`, `nomor`, `nama`, `kelas`, `tgl_pinjam`, `tgl_kembali`, `status`, `tgl_dibuat`) VALUES ('ISBN 978-602-8519-93-15', 'Kala Senja Menyapa', '16', 'Nia Yoviandini', '9E', '2023-08-14', '2023-08-21', 'Peminjaman', '2023-08-21')