app/Models/pinjamkembaliModel.php

SELECT *
FROM `pinjamkembali`
---
    public function getPinjamKembali($id = false)
    {
        if ($id === false) {
            return $this->findAll();